RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_adc.h
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_adc.h
 * @version $Rev:: 2791         $
 * @date    $Date:: 2022-11-24 #$
 * @brief   The header file of the ADC library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F1XXXX_ADC_H
#define __HT32F1XXXX_ADC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */


/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Constants ADC exported constants
  * @{
  */
#define IS_ADC(x)                               (x == HT_ADC)

#define ONE_SHOT_MODE                           (0x00000000)
#define CONTINUOUS_MODE                         (0x00000002)
#define DISCONTINUOUS_MODE                      (0x00000003)

#define IS_ADC_CONVERSION_MODE(REGULAR_MODE)    (((REGULAR_MODE) == ONE_SHOT_MODE)   || \
                                                 ((REGULAR_MODE) == CONTINUOUS_MODE) || \
                                                 ((REGULAR_MODE) == DISCONTINUOUS_MODE))

#define IS_ADC_HP_CONVERSION_MODE(HP_MODE)      (((HP_MODE) == ONE_SHOT_MODE)   || \
                                                 ((HP_MODE) == CONTINUOUS_MODE) || \
                                                 ((HP_MODE) == DISCONTINUOUS_MODE))


#define ADC_CH_0                                (0)
#define ADC_CH_1                                (1)
#define ADC_CH_2                                (2)
#define ADC_CH_3                                (3)
#define ADC_CH_4                                (4)
#define ADC_CH_5                                (5)
#define ADC_CH_6                                (6)
#define ADC_CH_7                                (7)
#if !(LIBCFG_NO_ADC_CH8_15)
#define ADC_CH_8                                (8)
#define ADC_CH_9                                (9)
#define ADC_CH_10                               (10)
#define ADC_CH_11                               (11)
#if (LIBCFG_ADC_CH12_15)
#define ADC_CH_12                               (12)
#define ADC_CH_13                               (13)
#define ADC_CH_14                               (14)
#define ADC_CH_15                               (15)
#define IS_ADC_CHANNEL12_15(CHANNEL)            (((CHANNEL) == ADC_CH_12) || ((CHANNEL) == ADC_CH_13) || \
                                                 ((CHANNEL) == ADC_CH_14) || ((CHANNEL) == ADC_CH_15))
#else
#define IS_ADC_CHANNEL12_15(CHANNEL)            (0)
#endif
#else
#define IS_ADC_CHANNEL8_14(CHANNEL)             (0)
#define ADC_CH_IVREF                            (15)
#endif
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)

#define ADC_CH_GNDREF ADC_CH_GND_VREF
#define ADC_CH_VREF   ADC_CH_VDD_VREF


#if (LIBCFG_NO_ADC_CH8_15)
#define IS_ADC_CHANNEL(CHANNEL)                 (((CHANNEL) == ADC_CH_0)    || ((CHANNEL) == ADC_CH_1)    || \
                                                 ((CHANNEL) == ADC_CH_2)    || ((CHANNEL) == ADC_CH_3)    || \
                                                 ((CHANNEL) == ADC_CH_4)    || ((CHANNEL) == ADC_CH_5)    || \
                                                 ((CHANNEL) == ADC_CH_6)    || ((CHANNEL) == ADC_CH_7)    || \
                                                 (IS_ADC_CHANNEL8_14(CHANNEL)) || \
                                                 ((CHANNEL) == ADC_CH_IVREF) || ((CHANNEL) == ADC_CH_GND_VREF) || \
                                                 ((CHANNEL) == ADC_CH_VDD_VREF))
#else
#define IS_ADC_CHANNEL(CHANNEL)                 (((CHANNEL) == ADC_CH_0)  || ((CHANNEL) == ADC_CH_1)  || \
                                                 ((CHANNEL) == ADC_CH_2)  || ((CHANNEL) == ADC_CH_3)  || \
                                                 ((CHANNEL) == ADC_CH_4)  || ((CHANNEL) == ADC_CH_5)  || \
                                                 ((CHANNEL) == ADC_CH_6)  || ((CHANNEL) == ADC_CH_7)  || \
                                                 ((CHANNEL) == ADC_CH_8)  || ((CHANNEL) == ADC_CH_9)  || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11) || \
                                                 (IS_ADC_CHANNEL12_15(CHANNEL)) || \
                                                 ((CHANNEL) == ADC_CH_GND_VREF) || ((CHANNEL) == ADC_CH_VDD_VREF))
#endif

#if (LIBCFG_NO_ADC_CH8_15)
#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (((CHANNEL) == ADC_CH_0)  || ((CHANNEL) == ADC_CH_1)  || \
                                                 ((CHANNEL) == ADC_CH_2)  || ((CHANNEL) == ADC_CH_3)  || \
                                                 ((CHANNEL) == ADC_CH_4)  || ((CHANNEL) == ADC_CH_5)  || \
                                                 ((CHANNEL) == ADC_CH_6)  || ((CHANNEL) == ADC_CH_7))
#else
#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (((CHANNEL) == ADC_CH_0)  || ((CHANNEL) == ADC_CH_1)  || \
                                                 ((CHANNEL) == ADC_CH_2)  || ((CHANNEL) == ADC_CH_3)  || \
                                                 ((CHANNEL) == ADC_CH_4)  || ((CHANNEL) == ADC_CH_5)  || \
                                                 ((CHANNEL) == ADC_CH_6)  || ((CHANNEL) == ADC_CH_7)  || \
                                                 ((CHANNEL) == ADC_CH_8)  || ((CHANNEL) == ADC_CH_9)  || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11) || \
                                                 (IS_ADC_CHANNEL12_15(CHANNEL)))
#endif

#define ADC_TRIG_SOFTWARE                       (1UL << 0)

/* ((ADCTCR[4] << 4) | (ADCTSR[20] << 20))                                                                  */
#if (!LIBCFG_NO_CMP_TRIG_ADC)
#define ADC_TRIG_CMP0                           ((1UL << 4) | (0UL << 20))
#define ADC_TRIG_CMP1                           ((1UL << 4) | (1UL << 20))
#endif

#if (!LIBCFG_NO_CMP_HPTRIG_ADC)
#define ADC_HPTRIG_CMP0                         ADC_TRIG_CMP0
#define ADC_HPTRIG_CMP1                         ADC_TRIG_CMP1
#endif

/* ((ADCTCR[3] << 3) | (ADCTSR[23:22] << 22) | (ADCTSR[19] << 19))                                          */
#define ADC_TRIG_BFTM0                          ((1UL << 3) | (0UL << 22) | (0UL << 19))
#define ADC_TRIG_BFTM1                          ((1UL << 3) | (0UL << 22) | (1UL << 19))

/* ((ADCTCR[3] << 3) | (ADCTSR[29:27]) << 27) | (ADCTSR[23:22] << 22) | (ADCTSR[19] << 19))                 */
#if (LIBCFG_PWM0)
#define ADC_TRIG_PWM0_MTO                       ((1UL << 3) | (0UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH0O                      ((1UL << 3) | (1UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH1O                      ((1UL << 3) | (2UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH2O                      ((1UL << 3) | (3UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH3O                      ((1UL << 3) | (4UL << 27) | (1UL << 22) | (0UL << 19))
#endif
#if (LIBCFG_PWM1)
#define ADC_TRIG_PWM1_MTO                       ((1UL << 3) | (0UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH0O                      ((1UL << 3) | (1UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH1O                      ((1UL << 3) | (2UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH2O                      ((1UL << 3) | (3UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH3O                      ((1UL << 3) | (4UL << 27) | (1UL << 22) | (1UL << 19))
#endif

/* ((ADCTCR[2] << 2) | (ADCTSR[26:24] << 24) | (ADCTSR[18:16] << 16))                                       */
#if (!LIBCFG_NO_MCTM0)
#define ADC_TRIG_MCTM0_MTO                      ((1UL << 2) | (0UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0O                     ((1UL << 2) | (1UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1O                     ((1UL << 2) | (2UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2O                     ((1UL << 2) | (3UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3O                     ((1UL << 2) | (4UL << 24) | (0UL << 16))
#endif

#if (!LIBCFG_NO_MCTM1)
#define ADC_TRIG_MCTM1_MTO                      ((1UL << 2) | (0UL << 24) | (1UL << 16))
#define ADC_TRIG_MCTM1_CH0O                     ((1UL << 2) | (1UL << 24) | (1UL << 16))
#define ADC_TRIG_MCTM1_CH1O                     ((1UL << 2) | (2UL << 24) | (1UL << 16))
#define ADC_TRIG_MCTM1_CH2O                     ((1UL << 2) | (3UL << 24) | (1UL << 16))
#define ADC_TRIG_MCTM1_CH3O                     ((1UL << 2) | (4UL << 24) | (1UL << 16))
#endif

